ApiApp/api_app/tests/taurus/api_upload_test_script.yml
execution:
- concurrency: 200
  throughput: 300
  ramp-up: 5ms
  hold-for: 1h
  steps: 5
  scenario: api-test-recording

scenarios:
  api-test-recording:
    timeout: 5s
    retrieve-resources: false
    store-cache: false
    store-cookie: false
    default-address: http://localhost:9090
    headers:
      User-Agent: 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36'
      Accept-Language: 'ru-RU,ru;q=0.8,en-US;q=0.6,en;q=0.4'
      Accept-Encoding: 'gzip, deflate, sdch'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp'
    requests:
      - /user_base_info/2